SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1176_EVK/LCDConf.c
/*********************************************************************
*                SEGGER Microcontroller GmbH                         *
*        Solutions for real time microcontroller applications        *
**********************************************************************
*                                                                    *
*        (c) 1996 - 2023  SEGGER Microcontroller GmbH                *
*                                                                    *
*        Internet: www.segger.com    Support:  support@segger.com    *
*                                                                    *
**********************************************************************

** emWin V6.36 - Graphical user interface for embedded applications **
All  Intellectual Property rights  in the Software belongs to  SEGGER.
emWin is protected by  international copyright laws.  Knowledge of the
source code may not be used to write a similar product.  This file may
only be used in accordance with the following terms:

The  software has  been licensed  to STMicroelectronics International
N.V. a Dutch company with a Swiss branch and its headquarters in Plan-
les-Ouates, Geneva, 39 Chemin du Champ des Filles, Switzerland for the
purposes of creating libraries for ARM Cortex-M-based 32-bit microcon_
troller products commercialized by Licensee only, sublicensed and dis_
tributed under the terms and conditions of the End User License Agree_
ment supplied by STMicroelectronics International N.V.
Full source code is available at: www.segger.com

We appreciate your understanding and fairness.
----------------------------------------------------------------------
Licensing information
Licensor:                 SEGGER Software GmbH
Licensed to:              STMicroelectronics International NV, 39, Chemin du Champ-des Filles, 1228 Plan Les Ouates, Geneva, SWITZERLAND
Licensed SEGGER software: emWin
License number:           GUI-00429
License model:            Buyout SRC [Buyout Source Code License, signed November 29th 2012]
Licensed product:         -
Licensed platform:        STMs ARM Cortex-M based 32 BIT CPUs
Licensed number of seats: -
----------------------------------------------------------------------
Support and Update Agreement (SUA)
SUA period:               2012-12-07 - 2023-12-31
Contact to extend SUA:    sales@segger.com
----------------------------------------------------------------------
File        : LCDConf.c
Purpose     : Display controller configuration (single layer)
---------------------------END-OF-HEADER------------------------------
*/

#include "GUI.h"
#include "GUIDRV_Lin.h"
#include "LCDConf.h"
#include "PIDConf.h"

#include "MIMXRT1176_cm7.h"

#include "fsl_gpio.h"
#include "fsl_iomuxc.h"
#include "fsl_clock.h"
#include "fsl_mipi_dsi.h"
#include "fsl_pxp.h"
#include "clock_config.h"

#include "fsl_mipi_dsi.h"
#include "fsl_rm68200.h"

#include "fsl_dc_fb_lcdifv2.h"

/*********************************************************************
*
*       OS configuration
*
**********************************************************************
*/
#define USE_OS  (1)

#if (USE_OS == 1)
  #define EMBOS     (1)
  #define FREERTOS  (2)
  #define OS EMBOS

  #if   (OS == EMBOS)
    #include "RTOS.h"
    #define  SEMAPHORE_TYPE                OS_SEMAPHORE
    #define  SEMAPHORE_HANDLE_TYPE         OS_SEMAPHORE *
    #define  MAKE_SEMAPHORE_HANDLE(sema)   &sema
  #elif (OS == FREERTOS)
    #include "FreeRTOS.h"
    #include "semphr.h"
    #define  SEMAPHORE_TYPE                SemaphoreHandle_t
    #define  SEMAPHORE_HANDLE_TYPE         SemaphoreHandle_t
    #define  MAKE_SEMAPHORE_HANDLE(sema)   sema
  #else
    #error "No RTOS selected"
  #endif
#endif

/*********************************************************************
*
*       Supported orientation modes (not to be changed)
*/
#define ROTATION_0         0
#define ROTATION_CW        1
#define ROTATION_180       2
#define ROTATION_CCW       3

/*********************************************************************
*
*       LCD configuration (TO BE MODIFIED)
*
**********************************************************************
*/
//
// 16 or 32 bpp supported.
//
#define LCD_BITS_PER_PIXEL   32

//
// Buffers / VScreens
//
#define NUM_BUFFERS  2 // Number of multiple buffers to be used (at least 1 buffer)
#define NUM_VSCREENS 1 // Number of virtual  screens to be used (at least 1 screen)

//
// Define number of layers for this configuration file. Must be equal or less than in GUIConf.h!
//
#undef  GUI_NUM_LAYERS
#define GUI_NUM_LAYERS 1

//
// Default display orientation. Should be one of the above defined display orientations.
//
#define ORIENTATION     ROTATION_CCW

//
// Allow run-time display rotation. Necessary for AppWizard ROTATEDISPLAY job.
//
#define ENABLE_DISPLAY_ROTATION   1

//
// Some emWin operations require running the PXP multiple times. For those cases,
// a temporary buffer is needed. Set the below define to 1 to use a persistent buffer
// as the temporary buffer without the need for dynamic memory allocations (improves performance).
// It is not recommended to turn this, given that enough memory is available.
//
#define USE_PXP_BUFFER    1

/*********************************************************************
*
*       LCD configuration (NOT TO BE MODIFIED)
*
**********************************************************************
*/
#define LCD_BYTES_PER_PIXEL    (LCD_BITS_PER_PIXEL / 8)
//
// Physical display size (not to be changed).
//
#define XSIZE_PHYS 720
#define YSIZE_PHYS 1280
//
// Porch values
//
#define HSW    8
#define HFP    32
#define HBP    32
#define VSW    2
#define VFP    16
#define VBP    14

#define LCDIF_POL_FLAGS  (kLCDIFV2_DataEnableActiveHigh | kLCDIFV2_VsyncActiveLow | kLCDIFV2_HsyncActiveLow | \
                               kLCDIFV2_DriveDataOnFallingClkEdge)

#define MIPI_DSI          (&g_mipiDsi)
#define MIPI_DSI_LANE_NUM 2
//
// Mipi pins
//
#define MIPI_PANEL_RST_GPIO   GPIO9
#define MIPI_PANEL_RST_PIN    1
#define MIPI_PANEL_POWER_GPIO GPIO11
#define MIPI_PANEL_POWER_PIN  16
//
// Backlight
//
#define MIPI_PANEL_BL_GPIO GPIO9
#define MIPI_PANEL_BL_PIN  29

#define MIPI_DPHY_BIT_CLK_ENLARGE(origin) (((origin) / 8) * 9)
//
// Master read priority
//
#define PXP_READ_QOS    *((U32 *)0x41043100)

/*********************************************************************
*
*       Automatic selection of driver and color conversion
*/
#if LCD_BITS_PER_PIXEL == 16
  #define COLOR_CONVERSION    GUICC_M565
  #define PIXEL_FORMAT        kVIDEO_PixelFormatRGB565
  #define LCD_DATA_BUS_WIDTH  kLCDIFV2_DataBus16Bit
  #define PXP_OUT_FORMAT      kPXP_OutputPixelFormatRGB565
  #define PXP_PS_FORMAT       kPXP_PsPixelFormatRGB565
  #define PXP_AS_FORMAT       kPXP_AsPixelFormatRGB565
  //
  #if   (ORIENTATION == ROTATION_0)
    #define DISPLAY_DRIVER      GUIDRV_LIN_16
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_OSX_16
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_OXY_16
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_OSY_16
  #elif (ORIENTATION == ROTATION_CW)
    #define DISPLAY_DRIVER      GUIDRV_LIN_OSX_16
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_OXY_16
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_OSY_16
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_16
  #elif (ORIENTATION == ROTATION_180)
    #define DISPLAY_DRIVER      GUIDRV_LIN_OXY_16
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_OSY_16
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_16
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_OSX_16
  #elif (ORIENTATION == ROTATION_CCW)
    #define DISPLAY_DRIVER      GUIDRV_LIN_OSY_16
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_16
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_OSX_16
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_OXY_16
  #endif
#else
  #define COLOR_CONVERSION    GUICC_M8888I
  #define PIXEL_FORMAT        kVIDEO_PixelFormatXRGB8888
  #define LCD_DATA_BUS_WIDTH  kLCDIFV2_DataBus16Bit
  #define PXP_OUT_FORMAT      kPXP_OutputPixelFormatARGB8888
  #define PXP_PS_FORMAT       kPXP_PsPixelFormatRGB888
  #define PXP_AS_FORMAT       kPXP_AsPixelFormatARGB8888
  //
  #if   (ORIENTATION == ROTATION_0)
    #define DISPLAY_DRIVER      GUIDRV_LIN_32
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_OSX_32
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_OXY_32
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_OSY_32
  #elif (ORIENTATION == ROTATION_CW)
    #define DISPLAY_DRIVER      GUIDRV_LIN_OSX_32
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_OXY_32
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_OSY_32
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_32
  #elif (ORIENTATION == ROTATION_180)
    #define DISPLAY_DRIVER      GUIDRV_LIN_OXY_32
    #define DISPLAY_DRIVER_CW   GUIDRV_LIN_OSY_32
    #define DISPLAY_DRIVER_180  GUIDRV_LIN_32
    #define DISPLAY_DRIVER_CCW  GUIDRV_LIN_OSX_32
  #elif (ORIENTATION == ROTATION_CCW)
    #define DISPLAY_DRIVER     GUIDRV_LIN_OSY_32
    #define DISPLAY_DRIVER_CW  GUIDRV_LIN_32
    #define DISPLAY_DRIVER_180 GUIDRV_LIN_OSX_32
    #define DISPLAY_DRIVER_CCW GUIDRV_LIN_OXY_32
  #endif
#endif

/*********************************************************************
*
*       Configuration checking
*
**********************************************************************
*/
#ifndef   VRAM_ADDR
  #define VRAM_ADDR (U32)(&_aVRAM0[0])
#endif
#ifndef   XSIZE_PHYS
  #error Physical X size of display is not defined!
#endif
#ifndef   YSIZE_PHYS
  #error Physical Y size of display is not defined!
#endif
#ifndef   COLOR_CONVERSION
  #error Color conversion not defined!
#endif
#ifndef   DISPLAY_DRIVER
  #error No display driver defined!
#endif
#if ((LCD_BITS_PER_PIXEL != 16) && (LCD_BITS_PER_PIXEL != 32))
  #error Invalid display bit depth defined!
#endif

/*********************************************************************
*
*       Prototypes
*
**********************************************************************
*/
static void _LCD_PXP_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat);
static void _LCD_PXP_Index2ColorBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat);
static void _PullPanelResetPin      (bool pullUp);
static void _PullPanelPowerPin      (bool pullUp);
static int  _DSI_Transfer           (dsi_transfer_t *xfer);

/*********************************************************************
*
*       Defines
*
**********************************************************************
*/
//
// Buffer related
//
#define LCD_XY2BufferPtr(x, y)     (U32)((U8 *)_aBufferAddress[_BackBuffer] + ((y * XSIZE_PHYS) + x) * LCD_BYTES_PER_PIXEL)
//
// PXP macros
//
#define PXP_PS_InvalidFormat           kPXP_PsPixelFormatY4     // Unused format, used here as invalid format flag
#define PXP_DisableSurface(surf)       PXP_Set##surf##SurfacePosition(PXP, 0xFFFFu, 0xFFFFu, 0u, 0u)
#define PXP_DisableProcessSurface()    PXP_DisableSurface(Process)
#define PXP_DisableAlphaSurface()      PXP_DisableSurface(Alpha)

#define DEFINE_PXP_COLOR2INDEX(SUFFIX, FORMAT)                                                                     \
  static void _LCD_PXP_Color2IndexBulk_##SUFFIX(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex) { \
    _LCD_PXP_Color2IndexBulk(pColor, pIndex, NumItems, SizeOfIndex, FORMAT);                                       \
  }

#define DEFINE_PXP_INDEX2COLOR(SUFFIX, FORMAT)                                                                     \
  static void _LCD_PXP_Index2ColorBulk_##SUFFIX(void * pIndex, LCD_COLOR * pColor, U32 NumItems, U8 SizeOfIndex) { \
    _LCD_PXP_Index2ColorBulk(pIndex, pColor, NumItems, SizeOfIndex, FORMAT);                                       \
  }

#define DEFINE_PXP_COLORCONV(SUFFIX, FORMAT)  \
  DEFINE_PXP_COLOR2INDEX(SUFFIX, FORMAT)      \
  DEFINE_PXP_INDEX2COLOR(SUFFIX, FORMAT)

#define GUI_PXP_SETCOLORCONV(FORMAT)   GUICC_##FORMAT##_SetCustColorConv(_LCD_PXP_Color2IndexBulk_##FORMAT, _LCD_PXP_Index2ColorBulk_##FORMAT)

/*********************************************************************
*
*       Types
*
**********************************************************************
*/
typedef enum {
  BUFFER_TYPE_FRAMEBUFFER = 0,
  BUFFER_TYPE_PROCESS_SURFACE,
  BUFFER_TYPE_ALPHA_SURFACE,
} BUFFER_TYPE;

