SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1176_EVK/LCDConf.c
  switch (_PXP_Rotation) {
  case kPXP_Rotate0:
    break;
  case kPXP_Rotate90:
    Temp = *px0;
    *px0 = XSIZE_PHYS - 1 - *px1;
    *px1 = XSIZE_PHYS - 1 - Temp;
    _Swap(px0, py0);
    _Swap(px1, py1);
    break;
  case kPXP_Rotate180:
    *px0 = XSIZE_PHYS - 1 - *px0;
    *px1 = XSIZE_PHYS - 1 - *px1;
    *py0 = YSIZE_PHYS - 1 - *py0;
    *py1 = YSIZE_PHYS - 1 - *py1;
    if (*px0 > *px1) {
      _Swap(px0, px1);
    }
    if (*py0 > *py1) {
      _Swap(py0, py1);
    }
    break;
  case kPXP_Rotate270:
    Temp = *py1;
    *py1 = (YSIZE_PHYS - 1 - *py0);
    *py0 = (YSIZE_PHYS - 1 - Temp);
    _Swap(px0, py0);
    _Swap(px1, py1);
    break;
  }
}

/*********************************************************************
*
*       _Phys2LogCoordsEx
*/
static void _Phys2LogCoordsEx(GUI_RECT * pRect) {
  int x0 = pRect->x0;
  int y0 = pRect->y0;
  int x1 = pRect->x1;
  int y1 = pRect->y1;
  _Phys2LogCoords(&x0, &y0, &x1, &y1);
  pRect->x0 = x0;
  pRect->y0 = y0;
  pRect->x1 = x1;
  pRect->y1 = y1;
}

/*********************************************************************
*
*       _GetBufferPtr
*/
static U32 _GetBufferPtr(int x, int y, int xSize, int ySize) {
  U8 * pBuffer;
  int  xPhys, yPhys;

  //
  // Convert logical coordinates to physical coordinates
  //
  _Log2PhysCoords(x, y, xSize, ySize, &xPhys, &yPhys);
  pBuffer  = (U8 *)_aBufferAddress[_BackBuffer];
  pBuffer += ((yPhys * XSIZE_PHYS) + xPhys) * LCD_BYTES_PER_PIXEL;
  return (U32)pBuffer;
}

/*********************************************************************
*
*       _PXP_ConfigOutBufferEx
*/
static void _PXP_ConfigOutBufferEx(void * pAddress, U32 Pitch, int xSize, int ySize, bool OverwriteAlpha, pxp_output_pixel_format_t PixelFmt) {
  pxp_output_buffer_config_t out_cfg;

  out_cfg.pixelFormat    = PixelFmt;
  out_cfg.interlacedMode = kPXP_OutputProgressive;
  out_cfg.buffer0Addr    = (U32)pAddress;
  out_cfg.buffer1Addr    = 0U;
  out_cfg.pitchBytes     = Pitch;
  out_cfg.width          = xSize;
  out_cfg.height         = ySize;
  PXP_SetOutputBufferConfig(PXP, &out_cfg);
  //
  // Make sure alpha channel is overwritten with 0xFF after the composite has been written to frame buffer.
  //
  if (OverwriteAlpha) {
    PXP->OUT_CTRL |= (0xFFu << 24) | (0x1u << 23);
  }
}

/*********************************************************************
*
*       _PXP_ConfigOutBuffer
*/
static void _PXP_ConfigOutBuffer(void * pAddress, U32 Pitch, int xSize, int ySize, bool OverwriteAlpha) {
  _PXP_ConfigOutBufferEx(pAddress, Pitch, xSize, ySize, OverwriteAlpha, PXP_OUT_FORMAT);
}

/*********************************************************************
*
*       _PXP_ConfigOutBufferAuto
*/
static int _PXP_ConfigOutBufferAuto(int x0, int y0, int xSize, int ySize) {
  GUI_MEMDEV_Handle hMem;
  U32               Addr;
  U32               AddrMem;
  void            * pData;
  int               xSizeDev, ySizeDev, BppDev;
  int               xPosDev, yPosDev;

  //
  // Check if there currently is a MEMDEV selected so that we can write into the device.
  //
  hMem = GUI_MEMDEV_GetSelMemdev();
  if (hMem) {
    _GetMemdevParams(hMem, &pData, &xSizeDev, &ySizeDev, &BppDev);
    if (BppDev != 32) {
      return 1;
    }
    xPosDev = GUI_MEMDEV_GetXPos(hMem);
    yPosDev = GUI_MEMDEV_GetYPos(hMem);
    x0     -= xPosDev;
    y0     -= yPosDev;
    AddrMem = ((U32)pData) + (((y0 * xSizeDev) + x0) * (BppDev / 8));
    _PXP_ConfigOutBuffer((void *)AddrMem, xSizeDev * (BppDev / 8), xSizeDev, ySizeDev, true);
  } else {
    Addr = _GetBufferPtr(x0, y0, xSize, ySize);
    _SwapSizesOnDemand(&xSize, &ySize);
    _PXP_ConfigOutBuffer((void *)Addr, XSIZE_PHYS * LCD_BYTES_PER_PIXEL, xSize, ySize, true);
  }
  return 0;
}

/*********************************************************************
*
*       _PXP_ConfigProcessSurfaceEx
*/
static void _PXP_ConfigProcessSurfaceEx(void * pAddress, U32 Pitch, int xSize, int ySize, pxp_ps_pixel_format_t PixelFmt) {
  pxp_ps_buffer_config_t ps_cfg;

  ps_cfg.bufferAddr  = (U32)pAddress;
  ps_cfg.bufferAddrU = 0;
  ps_cfg.bufferAddrV = 0;
  ps_cfg.pitchBytes  = Pitch;
  ps_cfg.pixelFormat = PixelFmt;
  ps_cfg.swapByte    = 0;
  PXP_SetProcessSurfaceBufferConfig(PXP, &ps_cfg);
  PXP_SetProcessSurfacePosition(PXP, 0, 0, xSize - 1, ySize - 1);
}

/*********************************************************************
*
*       _PXP_ConfigProcessSurface
*/
static void _PXP_ConfigProcessSurface(void * pAddress, U32 Pitch, int xSize, int ySize) {
  _PXP_ConfigProcessSurfaceEx(pAddress, Pitch, xSize, ySize, PXP_PS_FORMAT);
}

/*********************************************************************
*
*       _PXP_ConfigAlphaSurfaceEx
*/
static void _PXP_ConfigAlphaSurfaceEx(void * pAddress, U32 Pitch, int xSize, int ySize, pxp_as_pixel_format_t PixelFmt) {
  pxp_as_buffer_config_t as_cfg;

  as_cfg.pixelFormat = PixelFmt;
  as_cfg.bufferAddr  = (U32)pAddress;
  as_cfg.pitchBytes  = Pitch;
  PXP_SetAlphaSurfaceBufferConfig(PXP, &as_cfg);
  PXP_SetAlphaSurfacePosition(PXP, 0, 0, xSize - 1, ySize - 1);
}

/*********************************************************************
*
*       _PXP_ConfigAlphaSurface
*/
static void _PXP_ConfigAlphaSurface(void * pAddress, U32 Pitch, int xSize, int ySize) {
  _PXP_ConfigAlphaSurfaceEx(pAddress, Pitch, xSize, ySize, PXP_AS_FORMAT);
}

/*********************************************************************
*
*       _PXP_ConfigAlphaBlendNormal
*/
static void _PXP_ConfigAlphaBlendNormal(void) {
  pxp_as_blend_config_t blend_cfg;

  blend_cfg.alpha       = 0;
  blend_cfg.invertAlpha = 0;
  blend_cfg.alphaMode   = kPXP_AlphaEmbedded;
  PXP_SetAlphaSurfaceBlendConfig(PXP, &blend_cfg);
}

/*********************************************************************
*
*       _PXP_ConfigAlphaBlendMultiply
*/
static void _PXP_ConfigAlphaBlendMultiply(U8 Alpha) {
  pxp_as_blend_config_t blend_cfg;

  blend_cfg.alpha       = Alpha;
  blend_cfg.invertAlpha = 0;
  blend_cfg.alphaMode   = kPXP_AlphaMultiply;
  PXP_SetAlphaSurfaceBlendConfig(PXP, &blend_cfg);
}

/*********************************************************************
*
*       Static code: PXP related emWin functions
*
**********************************************************************
*/
/*********************************************************************
*
*       _LCD_PXP_SetProcessSurface
*/
static void _LCD_PXP_SetProcessSurface(void * pAddress, U32 Pitch, int xSize, int ySize, pxp_ps_pixel_format_t Fmt) {
  BUFFER_OBJ * pPS;

  _PXP_Context.pProcessSurface = pPS = &_PXP_aBuffer[BUFFER_TYPE_PROCESS_SURFACE];
  pPS->p            = pAddress;
  pPS->Type         = BUFFER_TYPE_PROCESS_SURFACE;
  pPS->xSize        = xSize;
  pPS->ySize        = ySize;
  pPS->BytesPerLine = Pitch;
  pPS->Format.Ps    = Fmt;
}

/*********************************************************************
*
*       _LCD_PXP_SetAlphaSurface
*/
static void _LCD_PXP_SetAlphaSurface(void * pAddress, U32 Pitch, int xSize, int ySize, pxp_as_pixel_format_t Fmt) {
  BUFFER_OBJ * pAS;

  _PXP_Context.pAlphaSurface = pAS = &_PXP_aBuffer[BUFFER_TYPE_ALPHA_SURFACE];
  pAS->p            = pAddress;
  pAS->Type         = BUFFER_TYPE_ALPHA_SURFACE;
  pAS->xSize        = xSize;
  pAS->ySize        = ySize;
  pAS->BytesPerLine = Pitch;
  pAS->Format.As    = Fmt;
}

/*********************************************************************
*
*       _LCD_PXP_GetFrameBufferConfig
*/
static BUFFER_OBJ * _LCD_PXP_GetFrameBufferConfig(LCD_PXP_DRAW_CONTEXT * pCtx) {
  BUFFER_OBJ * p = &_PXP_aBuffer[BUFFER_TYPE_FRAMEBUFFER];

  p->p              = (void *)_GetBufferPtr(pCtx->x, pCtx->y, pCtx->xSize, pCtx->ySize);
  p->xSize          = pCtx->xSize;
  p->ySize          = pCtx->ySize;
  p->Type           = BUFFER_TYPE_FRAMEBUFFER;
  p->Format.Out     = PXP_OUT_FORMAT;
  p->BytesPerLine   = XSIZE_PHYS * LCD_BYTES_PER_PIXEL;
  p->OverwriteAlpha = true;
  return p;
}

/*********************************************************************
*
*       _LCD_PXP_AlphaBlending
*/
static PXP_BLEND_INFO * _LCD_PXP_AlphaBlending(void) {
  LCD_PXP_DRAW_CONTEXT * pCtx   = &_PXP_Context;
  PXP_BLEND_INFO       * pBlend = &_PXP_Blend;

