SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1176_EVK/LCDConf.c
  pCtx->pBlend = pBlend;
  return pBlend;
}

/*********************************************************************
*
*       _LCD_PXP_InitContext
*/
static void _LCD_PXP_InitContext(int x, int y, int xSize, int ySize) {
  LCD_PXP_DRAW_CONTEXT * pCtx = &_PXP_Context;
  BUFFER_OBJ           * pOB;

  //
  // Clear all previous parameters.
  //
  memset(pCtx, 0, sizeof(LCD_PXP_DRAW_CONTEXT));
  pCtx->x     = x;
  pCtx->y     = y;
  pCtx->xSize = xSize;
  pCtx->ySize = ySize;
  //
  // Set frame buffer as output buffer.
  //
  pOB                 = _LCD_PXP_GetFrameBufferConfig(pCtx);
  pCtx->pOutputBuffer = pOB;
}

#define ROUND_UP_BY(div, n)    ((n % div) ? (n + (div - (n % div))) : n)
#define ROUND_DOWN_BY(div, n)  ((n % div) ? (n -        (n % div) ) : n)
/*********************************************************************
*
*       _PXP_CheckSizes
*/
static void _PXP_CheckSizes(int xSize, int ySize, LCD_PXP_SIZE_CONTEXT * pSize) {
  //
  // In case a size is not divisible by 16 (the block size set to the PXP),
  // we need the sizes rounded up and rounded down.
  // The rounded down size is the part of the bitmap that is drawn by the PXP.
  // The rounded up size is to incorporate the background of the bitmap will be
  // blended into. It is crucial for rotated configs that all sizes are divisible by 16.
  //
  *pSize->pxSizeRoundUp   = ROUND_UP_BY(16, xSize);
  *pSize->pySizeRoundUp   = ROUND_UP_BY(16, ySize);
  *pSize->pxSizeRoundDown = ROUND_DOWN_BY(16, xSize);
  *pSize->pySizeRoundDown = ROUND_DOWN_BY(16, ySize);
}

/*********************************************************************
*
*       _PXP_ClipSizes
*/
static void _PXP_ClipSizes(int x, int y, LCD_PXP_SIZE_CONTEXT * pSize) {
  int * pxSize = pSize->pxSizeRoundUp;
  int * pySize = pSize->pySizeRoundUp;

  if (x + *pxSize > (LCD_GetXSize())) {
    *pxSize = LCD_GetXSize() - x;
  }
  if (y + *pySize > (LCD_GetYSize())) {
    *pySize = LCD_GetYSize() - y;
  }
}

/*********************************************************************
*
*       _PXP_InvertRotation
*/
static pxp_rotate_degree_t _PXP_InvertRotation(void) {
  switch (_PXP_Rotation) {
  case kPXP_Rotate0:
    return kPXP_Rotate0;
  case kPXP_Rotate90:
    return kPXP_Rotate270;
  case kPXP_Rotate180:
    return kPXP_Rotate180;
  case kPXP_Rotate270:
    return kPXP_Rotate90;
  }
  return kPXP_Rotate0;
}

/*********************************************************************
*
*       _LCD_PXP_ConfigOutputBuffer
*/
static void _LCD_PXP_ConfigOutputBuffer(BUFFER_OBJ * pBuffer) {
  _PXP_ConfigOutBufferEx(pBuffer->p, pBuffer->BytesPerLine, pBuffer->xSize, pBuffer->ySize, pBuffer->OverwriteAlpha, pBuffer->Format.Out);
}

/*********************************************************************
*
*       _LCD_PXP_ConfigProcessSurface
*/
static void _LCD_PXP_ConfigProcessSurface(BUFFER_OBJ * pBuffer) {
  _PXP_ConfigProcessSurfaceEx(pBuffer->p, pBuffer->BytesPerLine, pBuffer->xSize, pBuffer->ySize, pBuffer->Format.Ps);
}

/*********************************************************************
*
*       _LCD_PXP_ConfigAlphaSurface
*/
static void _LCD_PXP_ConfigAlphaSurface(BUFFER_OBJ * pBuffer) {
  _PXP_ConfigAlphaSurfaceEx(pBuffer->p, pBuffer->BytesPerLine, pBuffer->xSize, pBuffer->ySize, pBuffer->Format.As);
}

/*********************************************************************
*
*       _PXP_ConfigAlphaBlend
*/
static void _LCD_PXP_ConfigAlphaBlend(PXP_BLEND_INFO * pBlend) {
  if (!pBlend) {
    return;
  }
  if (pBlend->Mode & BLEND_MODE_NORMAL) {
    _PXP_ConfigAlphaBlendNormal();
  }
  if (pBlend->Mode & BLEND_MODE_MULTIPLY) {
    _PXP_ConfigAlphaBlendMultiply(pBlend->Alpha);
  }
  if (pBlend->Mode & BLEND_MODE_PORTERDUFF) {
    _PXP_SetPorterDuffMode(pBlend->PorterDuffMode);
  }
}

/*********************************************************************
*
*       _GetSizeUnmirrored
*/
static void _GetSizeUnmirrored(int xSize, int ySize, int * pOutXSize, int * pOutYSize) {
  switch (_PXP_Rotation) {
  case kPXP_Rotate0:
  case kPXP_Rotate180:
    *pOutXSize = xSize;
    *pOutYSize = ySize;
    break;
  case kPXP_Rotate90:
  case kPXP_Rotate270:
    *pOutXSize = ySize;
    *pOutYSize = xSize;
    break;
  }
}

/*********************************************************************
*
*       _LCD_PXP_DrawBitmap
*
*  Used by all functions which need to observe the current rotation
*  (i.e. most bitmap functions that output directly to the screen).
*  Functions drawing into memory devices do not need to call this function.
*/
static int _LCD_PXP_DrawBitmap(LCD_PXP_DRAW_CONTEXT * pCtx) {
  U32                  Addr;
  int                  xSizeRD, ySizeRD, xSizeRU, ySizeRU; // x/ySize rounded down and up
  LCD_PXP_SIZE_CONTEXT Sizes =  { &xSizeRU, &ySizeRU, &xSizeRD, &ySizeRD };
  void               * pBuffer = NULL;
  int                  x = pCtx->x, y = pCtx->y;
  bool                 IsRotated = (_PXP_Rotation != kPXP_Rotate0);
  BUFFER_OBJ         * pOut, *pAS;
  int                  xSizeUM, ySizeUM;
  int                  xDiff = 0, yDiff = 0;

  _PXP_InitOperation();
  //
  // Non-rotated config: entire operation is done with one PXP iteration.
  //
  if (!IsRotated  || !pCtx->pAlphaSurface) {
    //
    // Set rotation if required.
    //
    if (IsRotated) {
      PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, _PXP_Rotation, kPXP_FlipDisable);
    }
    //
    // Configure output buffer. If a specific buffer has been set, use it (e.g. memdev).
    // If not, use the default which is the backbuffer.
    //
    pOut = (pCtx->pOutputBuffer) ? pCtx->pOutputBuffer : _LCD_PXP_GetFrameBufferConfig(pCtx);
    _LCD_PXP_ConfigOutputBuffer(pOut);
    //
    // Enable/disable PS.
    //
    if (!pCtx->pProcessSurface) {
      PXP_DisableProcessSurface();
    } else {
      _LCD_PXP_ConfigProcessSurface(pCtx->pProcessSurface);
    }
    //
    // Enable/disable AS and alpha blending.
    //
    if (!pCtx->pAlphaSurface) {
      PXP_DisableAlphaSurface();
    } else {
      _LCD_PXP_ConfigAlphaSurface(pCtx->pAlphaSurface);
      _LCD_PXP_ConfigAlphaBlend(pCtx->pBlend);
    }
    _PXP_StartOperation();
  }
  //
  // In rotated configs with semi-transparent bitmaps, two steps are required.
  //
  else {
    //
    // Step 1: Copy affected frame buffer area and rotate it against the current angle into the temp. buffer.
    // We rotate here in the opposite direction to have the frame buffer content unrotated, just like the bitmap is.
    //
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, _PXP_InvertRotation(), kPXP_FlipDisable);
    _PXP_CheckSizes(pCtx->xSize, pCtx->ySize, &Sizes);
    xDiff = xSizeRU;
    yDiff = ySizeRU;
    _PXP_ClipSizes(x, y, &Sizes);
    xDiff -= xSizeRU;
    yDiff -= ySizeRU;
    pBuffer = _Malloc(ySizeRU * xSizeRU * LCD_BYTES_PER_PIXEL);
    if (!pBuffer) {
      return 1;
    }
    _GetSizeUnmirrored(xSizeRU, ySizeRU, &xSizeUM, &ySizeUM);
    _PXP_ConfigOutBuffer(pBuffer, xSizeRU * LCD_BYTES_PER_PIXEL, xSizeUM, ySizeUM, true);
    PXP_DisableAlphaSurface();
    Addr = _GetBufferPtr(x, y, xSizeRU, ySizeRU);
    _PXP_ConfigProcessSurface((void *)Addr, XSIZE_PHYS * LCD_BYTES_PER_PIXEL, xSizeUM, ySizeUM);
    _PXP_StartOperation();
    //
    // Step 2: Blend alpha bitmap over copied area in temp. buffer into the frame buffer.
    //
    _PXP_InitOperation();
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, _PXP_Rotation, kPXP_FlipDisable);
    //
    // Make sure size of output buffer is aligned.
    //
    pOut = (pCtx->pOutputBuffer) ? pCtx->pOutputBuffer : _LCD_PXP_GetFrameBufferConfig(pCtx);
    pOut->xSize = xSizeRU;
    pOut->ySize = ySizeRU;
    pOut->p     = (void *)Addr;
    _LCD_PXP_ConfigOutputBuffer(pOut);
    //
    // Blend bitmap as AS over PS into frame buffer.
    //
    _PXP_ConfigProcessSurface(pBuffer, xSizeRU * LCD_BYTES_PER_PIXEL, xSizeRU, ySizeRU);
    pAS = pCtx->pAlphaSurface;
    _LCD_PXP_ConfigAlphaSurface(pAS);
    _LCD_PXP_ConfigAlphaBlend(pCtx->pBlend);
    if (_PXP_Rotation == kPXP_Rotate180) {
      PXP_SetAlphaSurfacePosition(PXP, xDiff, yDiff, pAS->xSize + xDiff - 1, pAS->ySize + yDiff - 1);
    }
    _PXP_StartOperation();
  }
  return 0;
}

/*********************************************************************
*
*       _LCD_PXP_CopyBuffer
*/
static void _LCD_PXP_CopyBuffer(int LayerIndex, int IndexSrc, int IndexDst) {
  GUI_USE_PARA(LayerIndex);

