SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1176_EVK/LCDConf.c
  _PXP_InitOperation();
  //
  // Configure destination buffer as output buffer.
  //
  _PXP_ConfigOutBuffer((void *)_aBufferAddress[IndexDst], XSIZE_PHYS * LCD_BYTES_PER_PIXEL, XSIZE_PHYS, YSIZE_PHYS, true);
  //
  // Configure source buffer as PS.
  //
  _PXP_ConfigProcessSurface((void *)_aBufferAddress[IndexSrc], XSIZE_PHYS * LCD_BYTES_PER_PIXEL, XSIZE_PHYS, YSIZE_PHYS);
  //
  // AS not needed.
  //
  PXP_DisableAlphaSurface();
  _PXP_StartOperation();
  //
  // Clear cache to avoid artefacts on the screen.
  //
  GUI_DCACHE_Clear(0);
  //
  // Buffer switch done.
  //
  _BackBuffer = IndexDst;
}

/*********************************************************************
*
*       _LCD_PXP_FillRect
*/
static void _LCD_PXP_FillRect(int LayerIndex, int x0, int y0, int x1, int y1, U32 PixelIndex) {
  pxp_porter_duff_config_t pd_cfg;
  U8                       Alpha;
  U32                      Addr;
  U32                      w, h;
  GUI_COLOR                Color;

  GUI_USE_PARA(LayerIndex);
  //
  // Do XOR filling by software.
  //
  if (GUI_GetDrawMode() & GUI_DM_XOR) {
    LCD_SetDevFunc(0, LCD_DEVFUNC_FILLRECT, (void(*)(void))NULL);
    _Phys2LogCoords(&x0, &y0, &x1, &y1);
    LCD_FillRect(x0, y0, x1, y1);
    LCD_SetDevFunc(0, LCD_DEVFUNC_FILLRECT, (void(*)(void))_LCD_PXP_FillRect);
    return;
  }
  //
  // Non-XOR filling done by PXP.
  //
  _PXP_InitOperation();
  w = x1 - x0 + 1;
  h = y1 - y0 + 1;
  //
  // Configure output buffer.
  // This is a low-level driver function, coordinates are physical not logical.
  //
  Addr = LCD_XY2BufferPtr(x0, y0);
  _PXP_ConfigOutBuffer((void *)Addr, XSIZE_PHYS * LCD_BYTES_PER_PIXEL, w, h, true);
  //
  Color = GUI_Index2Color(PixelIndex);
  Alpha = GUI_GetAlpha();
  if (Alpha == 0xFF) {
    //
    // Opaque fill, AS not needed.
    //
    PXP_DisableAlphaSurface();
  } else {
    //
    // Transparency fill, output buffer is used as AS.
    //
    _PXP_ConfigAlphaSurface((void *)Addr, XSIZE_PHYS * LCD_BYTES_PER_PIXEL, w, h);
  }
  //
  // Disable PS, instead generate color.
  //
  PXP_DisableProcessSurface();
  PXP_SetProcessSurfaceBackGroundColor(PXP, Color);
  //
  // Configure Porter-Duff blending.
  //
  pd_cfg.enable             = 1;
  pd_cfg.dstColorMode       = kPXP_PorterDuffColorNoAlpha;
  pd_cfg.srcColorMode       = kPXP_PorterDuffColorNoAlpha;
  pd_cfg.dstGlobalAlphaMode = kPXP_PorterDuffGlobalAlpha;
  pd_cfg.srcGlobalAlphaMode = kPXP_PorterDuffGlobalAlpha;
  pd_cfg.dstFactorMode      = kPXP_PorterDuffFactorStraight;
  pd_cfg.srcFactorMode      = (Alpha == 0xFF) ? kPXP_PorterDuffFactorStraight : kPXP_PorterDuffFactorInversed;
  pd_cfg.dstGlobalAlpha     = Alpha;
  pd_cfg.srcGlobalAlpha     = Alpha;
  pd_cfg.dstAlphaMode       = kPXP_PorterDuffAlphaStraight;
  pd_cfg.srcAlphaMode       = kPXP_PorterDuffAlphaStraight;
  PXP_SetPorterDuffConfig(PXP, &pd_cfg);
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_DrawMemdevAlpha
*/
static void _LCD_PXP_DrawMemdevAlpha(void * pDst, const void * pSrc, int xSize, int ySize, int BytesPerLineDst, int BytesPerLineSrc) {
  _PXP_InitOperation();
  //
  // Destination device is output buffer.
  //
  _PXP_ConfigOutBuffer(pDst, BytesPerLineDst, xSize, ySize, false);
  //
  // Configure destination device as PS.
  //
  _PXP_ConfigProcessSurface(pDst, BytesPerLineDst, xSize, ySize);
  //
  // Configure bitmap as AS.
  //
  _PXP_ConfigAlphaSurfaceEx((void *)pSrc, BytesPerLineSrc, xSize, ySize, kPXP_AsPixelFormatARGB8888);
  _PXP_ConfigAlphaBlendNormal();
  //
  // Set Porter-Duff blending to SrcOver.
  //
  _PXP_SetPorterDuffMode(kPXP_PorterDuffOver);
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_DrawBitmap32bpp
*/
static void _LCD_PXP_DrawBitmap32bpp(int LayerIndex, int x, int y, U16 const * p, int xSize, int ySize, int BytesPerLine) {
  LCD_PXP_DRAW_CONTEXT * pCtx = &_PXP_Context;
  BUFFER_OBJ           * pPS;

  GUI_USE_PARA(LayerIndex);
  //
  // Use actual xSize according to pitch of buffer.
  //
  _LCD_PXP_InitContext(x, y, xSize, ySize);
  //
  // Set bitmap as AS and blend normally.
  //
  _LCD_PXP_SetAlphaSurface((void *)p, BytesPerLine, xSize, ySize, kPXP_AsPixelFormatARGB8888);
  _LCD_PXP_AlphaBlending()->Mode = BLEND_MODE_NORMAL;
  //
  // Use frame buffer as PS, copy output buffer config to PS config.
  //
  pCtx->pProcessSurface = pPS = &_PXP_aBuffer[BUFFER_TYPE_PROCESS_SURFACE];
  *pPS                  = *pCtx->pOutputBuffer;
  pPS->Format.Ps        = kPXP_PsPixelFormatRGB888;
  //
  // Draw 32bpp alpha bitmap into frame buffer.
  //
  _LCD_PXP_DrawBitmap(pCtx);
}

/*********************************************************************
*
*       _LCD_PXP_CopyRect
*/
static void _LCD_PXP_CopyRect(int LayerIndex, int x0, int y0, int x1, int y1, int xSize, int ySize) {
  U32      AddrSrc, AddrDst;
  void   * pBuffer = NULL;
  GUI_RECT rSrc    = { x0, y0, x0 + xSize - 1, y0 + ySize - 1 };
  GUI_RECT rDst    = { x1, y1, x1 + xSize - 1, y1 + ySize - 1 };
  int      PitchSrc;

  GUI_USE_PARA(LayerIndex);
  _PXP_InitOperation();
  AddrSrc = _GetBufferPtr(x0, y0, xSize, ySize);
  AddrDst = _GetBufferPtr(x1, y1, xSize, ySize);
  //
  // Swap if X/Y axis are mirrored.
  //
  _SwapSizesOnDemand(&xSize, &ySize);
  //
  // Use buffer if the rectangles intersect
  //
  PitchSrc = XSIZE_PHYS * LCD_BYTES_PER_PIXEL;
  if (GUI_RectsIntersect(&rSrc, &rDst)) {
    pBuffer = _Malloc(LCD_GetXSize() * LCD_GetYSize() * LCD_BYTES_PER_PIXEL);
    if (!pBuffer) {
      //
      // Fallback to software.
      // Coordinates are physical, they need to be converted to logical coords.
      //
      _Phys2LogCoordsEx(&rSrc);
      _Phys2LogCoordsEx(&rDst);
      LCD_SetDevFunc(0, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))NULL);
      GUI_CopyRect(rSrc.x0, rSrc.y0, rDst.x0, rDst.y0, rSrc.x1 - rSrc.x0 + 1, rSrc.y1 - rSrc.y0 + 1);
      LCD_SetDevFunc(0, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))_LCD_PXP_CopyBuffer);
      return;
    }
    PitchSrc = xSize * LCD_BYTES_PER_PIXEL;
    //
    // Configure output buffer.
    //
    _PXP_ConfigOutBuffer(pBuffer, PitchSrc, xSize, ySize, true);
    //
    // Configure rect to be copied as processing surface.
    //
    _PXP_ConfigProcessSurface((void *)AddrSrc, XSIZE_PHYS * LCD_BYTES_PER_PIXEL, xSize, ySize);
    //
    // AS not needed.
    //
    PXP_DisableAlphaSurface();
    _PXP_StartOperation();
    //
    // Configure address for final copy.
    //
    AddrSrc = (U32)pBuffer;
  }
  //
  // Configure output buffer.
  //
  _PXP_ConfigOutBuffer((void *)AddrDst, XSIZE_PHYS * LCD_BYTES_PER_PIXEL, xSize, ySize, true);
  //
  // Configure rect to be copied as processing surface.
  //
  _PXP_ConfigProcessSurface((void *)AddrSrc, PitchSrc, xSize, ySize);
  //
  // AS not needed.
  //
  PXP_DisableAlphaSurface();
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_MixColorsBulk
*/
static void _LCD_PXP_MixColorsBulk(U32 * pFG, U32 * pBG, U32 * pDst, unsigned OffFG, unsigned OffBG, unsigned OffDest, unsigned xSize, unsigned ySize, U8 Intens) {
  GUI_USE_PARA(OffFG);
  GUI_USE_PARA(OffDest);
  _PXP_InitOperation();
  //
  // Configure output buffer.
  //
  _PXP_ConfigOutBuffer(pDst, xSize * LCD_BYTES_PER_PIXEL, xSize, ySize, false);
  //
  // Configure BG as PS.
  //
  _PXP_ConfigProcessSurface(pBG, (xSize + OffBG) * LCD_BYTES_PER_PIXEL, xSize, ySize);
  //
  // Configure FG as AS.
  //
  _PXP_ConfigAlphaSurface(pFG, xSize * LCD_BYTES_PER_PIXEL, xSize, ySize);
  _PXP_ConfigAlphaBlendMultiply(Intens);
  //
  // Configure Porter-Duff mode.
  //
  _PXP_SetPorterDuffMode(kPXP_PorterDuffOver);
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_DrawMemdevM565
*/
static void _LCD_PXP_DrawMemdevM565(void * pDst, const void * pSrc, int xSize, int ySize, int BytesPerLineDst, int BytesPerLineSrc) {
  _PXP_InitOperation();
  //
  // 32bpp memdev is output buffer.
  //
  _PXP_ConfigOutBufferEx(pDst, BytesPerLineDst, xSize, ySize, false, kPXP_OutputPixelFormatARGB8888);
  //
  // Destination memdev is configured as PS.
  //
  _PXP_ConfigProcessSurfaceEx(pDst, BytesPerLineDst, xSize, ySize, kPXP_PsPixelFormatRGB888);
  //
  // Configure source device as AS.
  //
  _PXP_ConfigAlphaSurfaceEx((void *)pSrc, BytesPerLineSrc, xSize, ySize, kPXP_AsPixelFormatRGB565);
  _PXP_ConfigAlphaBlendNormal();
  //
  // Set Porter-Duff blending to SrcOver.
  //
  _PXP_SetPorterDuffMode(kPXP_PorterDuffOver);
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_DrawMemdev16bpp
*/
static void _LCD_PXP_DrawMemdev16bpp(void * pDst, const void * pSrc, int xSize, int ySize, int BytesPerLineDst, int BytesPerLineSrc) {
  GUI_USE_PARA(BytesPerLineSrc);
  _PXP_InitOperation();
  //
  // Output buffer is 16bpp memdev.
  //
  _PXP_ConfigOutBufferEx(pDst, BytesPerLineDst, xSize, ySize, false, kPXP_OutputPixelFormatRGB565);
  //
  // Source memdev is configured as PS.
  //
  _PXP_ConfigProcessSurfaceEx((void *)pSrc, BytesPerLineDst, xSize, ySize, kPXP_PsPixelFormatRGB565);
  //
  // Bitmap does not have alpha, AS not needed.
  //
  PXP_DisableAlphaSurface();
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_DrawBitmapM565
*/
static void _LCD_PXP_DrawBitmapM565(int LayerIndex, int x, int y, const void * p, int xSize, int ySize, int BytesPerLine) {
  LCD_PXP_DRAW_CONTEXT * pCtx = &_PXP_Context;

  GUI_USE_PARA(LayerIndex);
  //
  // Use actual xSize according to pitch of buffer.
  //
  _LCD_PXP_InitContext(x, y, xSize, ySize);
  //
  // Set 16bpp bitmap as PS.
  //
  _LCD_PXP_SetProcessSurface((void *)p, BytesPerLine, xSize, ySize, kPXP_PsPixelFormatRGB565);
  //
  // Draw 16bpp opaque bitmap into frame buffer.
  //
  _LCD_PXP_DrawBitmap(pCtx);
}

/*********************************************************************
*
*       _LCD_PXP_BlendMemdev
*/
static int _LCD_PXP_BlendMemdev(GUI_MEMDEV_Handle hMem, GUI_COLOR Color, U8 BlendIntens) {
  U32  * pBuffer;
  U32    NumBytes;
  void * pDst;
  int    BitsPerPixel;
  int    BytesPerPixel;
  int    xSize, ySize;
  
