SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1176_EVK/LCDConf.c
  _GetMemdevParams(hMem, &pDst, &xSize, &ySize, &BitsPerPixel);
  BytesPerPixel = BitsPerPixel / 8;
  if (BitsPerPixel != 32) {
    return 1;
  }
  //
  // Allocate temp. buffer
  //
  NumBytes = xSize * ySize * BytesPerPixel;
  pBuffer  = (U32 *)_Malloc(NumBytes);
  if (pBuffer == NULL) {
    return 1;
  }
  //
  // Step 1: Fill buffer with given color and given alpha value
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBuffer(pBuffer, xSize * BytesPerPixel, xSize, ySize, true);
  //
  // No AS needed.
  //
  PXP_DisableAlphaSurface();
  //
  // Disable PS, generate the color instead.
  //
  PXP_DisableProcessSurface();
  PXP_SetProcessSurfaceBackGroundColor(PXP, Color);
  //
  _PXP_StartOperation();
  //
  // Step 2: Blend temp. buffer over memory device.
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBufferEx(pDst, xSize * BytesPerPixel, xSize, ySize, false, kPXP_OutputPixelFormatARGB8888);
  //
  // Configure memdev as PS.
  //
  _PXP_ConfigProcessSurfaceEx(pDst, xSize * BytesPerPixel, xSize, ySize, kPXP_PsPixelFormatRGB888);
  //
  // Use temp. buffer as AS.
  //
  _PXP_ConfigAlphaSurfaceEx(pBuffer, xSize * BytesPerPixel, xSize, ySize, kPXP_AsPixelFormatARGB8888);
  //
  // Set Porter-Duff blending to SrcOver.
  //
  _PXP_ConfigAlphaBlendMultiply(BlendIntens);
  _PXP_SetPorterDuffMode(kPXP_PorterDuffOver);
  _PXP_StartOperation();
  return 0;
}

/*********************************************************************
*
*       _LCD_PXP_GetPsFormatFromBitmap
*/
static pxp_ps_pixel_format_t _LCD_PXP_GetPsFormatFromBitmap(const GUI_BITMAP * pBitmap) {
  if (pBitmap->pMethods == GUI_DRAW_BMPM8888I) {
    return kPXP_PsPixelFormatRGB888;
  }
  if (pBitmap->pMethods == GUI_DRAW_BMPM565) {
    return kPXP_PsPixelFormatRGB565;
  }
  if (pBitmap->pMethods == GUI_DRAW_BMPM444_12) {
    return kPXP_PsPixelFormatRGB444;
  }
  if (pBitmap->pMethods == GUI_DRAW_BMP555) {
    return kPXP_PsPixelFormatRGB555;
  }
  return PXP_PS_InvalidFormat;
}

/*********************************************************************
*
*       _LCD_PXP_DrawBitmapEx
*/
static int _LCD_PXP_DrawBitmapEx(const GUI_BITMAP * pBitmap, int x0, int y0, int xMag, int yMag) {
  pxp_ps_pixel_format_t Fmt;
  pxp_flip_mode_t       FlipMode;
  int                   xSizeScaled;
  int                   ySizeScaled;
  int                   DevClass;
  bool                  TwoSteps;
  U32                   NumBytes;
  void                * pBuffer;
  pxp_rotate_degree_t   Rotation = _PXP_Rotation;
  bool                  Scaling;
  int                   xSizeRD, ySizeRD, xSizeRU, ySizeRU;
  LCD_PXP_SIZE_CONTEXT  Ctx = { &xSizeRU, &ySizeRU, &xSizeRD, &ySizeRD };
  int                   Pitch;

  //
  // We only want to write into the frame buffer or the current MEMDEV.
  //
  DevClass = GUI_DEVICE_GetDeviceClass();
  if ((DevClass != DEVICE_CLASS_DRIVER) && (DevClass != DEVICE_CLASS_MEMDEV)) {
    return 1;
  }
  //
  // Convert bitmap format to processing surface format. If the format is not supported by PXP we abort.
  //
  Fmt = _LCD_PXP_GetPsFormatFromBitmap(pBitmap);
  if (Fmt == PXP_PS_InvalidFormat) {
    return 1;
  }
  //
  // Retrieve flip mode to be used.
  // We also always need positive scaling factors.
  //
  FlipMode  = kPXP_FlipDisable;
  if (xMag < 0) {
    FlipMode |= kPXP_FlipHorizontal;
    xMag      = -xMag;
  }
  if (yMag < 0) {
    FlipMode |= kPXP_FlipVertical;
    yMag      = -yMag;
  }
  xSizeScaled = (pBitmap->XSize * xMag) / 1000;
  ySizeScaled = (pBitmap->YSize * yMag) / 1000;
  //
  // Do operation by software if desired size is too small or too large.
  //
  if (!(_PXP_ScalingParamValid(pBitmap->XSize, xSizeScaled) && _PXP_ScalingParamValid(pBitmap->YSize, ySizeScaled))) {
    return 1;
  }
  //
  // In case we output into a memory device, it must not be rotated.
  //
  if (DevClass == DEVICE_CLASS_MEMDEV) {
    Rotation = kPXP_Rotate0;
  }
  //
  // Vertical flipping (same as rotation) and scaling cannot be done in one step.
  //
  Scaling  = ((xMag != 1000) || (yMag != 1000)) ? true : false;
  TwoSteps = ((Scaling && (FlipMode & kPXP_FlipVertical)) || (Rotation != kPXP_Rotate0)) ? true : false;
  _PXP_InitOperation();
  if (!TwoSteps) {
    //
    // Set flipping mode and rotation.
    //
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, Rotation, FlipMode);
    //
    // Config scaling params for PS.
    //
    PXP_SetProcessSurfaceScaler(PXP, pBitmap->XSize, pBitmap->YSize, xSizeScaled, ySizeScaled);
    //
    // Configure bitmap as PS.
    //
    PXP_DisableAlphaSurface();
    _PXP_ConfigProcessSurfaceEx((void *)pBitmap->pData, pBitmap->BytesPerLine, xSizeScaled, ySizeScaled, Fmt);
    //
    // Configure output buffer.
    //
    _PXP_ConfigOutBufferAuto(x0, y0, xSizeScaled, ySizeScaled);
    //
    // Execute and done.
    //
    _PXP_StartOperation();
  } else {
    _PXP_CheckSizes(pBitmap->XSize, pBitmap->YSize, &Ctx);
    _PXP_ClipSizes(x0, y0, &Ctx);
    //
    // Step 1: Do flipping and/or rotation operation to temp. buffer.
    // Output will be converted into 32bpp pixels.
    //
    NumBytes = (sizeof(U32) * xSizeRU * ySizeRU);
    pBuffer  = _Malloc(NumBytes);
    if (pBuffer == NULL) {
      return 1;
    }
    Pitch = (LCD_GetSwapXY()) ? (sizeof(U32) * ySizeRU) : (sizeof(U32) * xSizeRU);
    //
    // Set flipping mode but no rotation.
    //
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, Rotation, FlipMode);
    //
    // Use temp. buffer as output buffer for this step.
    //
    _PXP_ConfigOutBufferEx(pBuffer, Pitch, pBitmap->XSize, pBitmap->YSize, true, kPXP_OutputPixelFormatARGB8888);
    //
    // Configure bitmap as PS.
    //
    PXP_DisableAlphaSurface();
    _PXP_ConfigProcessSurfaceEx((void *)pBitmap->pData, pBitmap->BytesPerLine, pBitmap->XSize, pBitmap->YSize, Fmt);
    _PXP_StartOperation();
    //
    // Step 2: Scale the flipped bitmap.
    //
    _PXP_InitOperation();
    PXP_SetProcessSurfaceScaler(PXP, pBitmap->XSize, pBitmap->YSize, xSizeScaled, ySizeScaled);
    PXP_SetRotateConfig(PXP, kPXP_RotateOutputBuffer, kPXP_Rotate0, kPXP_FlipDisable);
    //
    // Configure output buffer.
    //
    _PXP_ConfigOutBufferAuto(x0, y0, xSizeScaled, ySizeScaled);
    //
    // Configure temp. buffer as PS.
    //
    PXP_DisableAlphaSurface();
    _SwapSizesOnDemand(&xSizeScaled, &ySizeScaled); // Swap sizes if required for PS.
    _PXP_ConfigProcessSurfaceEx(pBuffer, Pitch, xSizeScaled, ySizeScaled, kPXP_PsPixelFormatRGB888);
    //
    // We are done, start PXP and free memory.
    //
    _PXP_StartOperation();
  }
  return 0;
}

/*********************************************************************
*
*       Custom color conversions
*/
DEFINE_PXP_COLORCONV(M1555I, kPXP_OutputPixelFormatARGB1555)
DEFINE_PXP_COLORCONV(M565,   kPXP_OutputPixelFormatRGB565)
DEFINE_PXP_COLORCONV(M4444I, kPXP_OutputPixelFormatARGB4444)
DEFINE_PXP_COLORCONV(M8888I, kPXP_OutputPixelFormatARGB8888)
DEFINE_PXP_COLOR2INDEX(M888, kPXP_OutputPixelFormatRGB888P)

/*********************************************************************
*
*       _LCD_PXP_Color2IndexBulk
*/
static void _LCD_PXP_Color2IndexBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat) {
  //
  // Set input color buffer as AS so that alpha values are also converted.
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBufferEx(pIndex, NumItems * SizeOfIndex, NumItems, 1, false, PixelFormat);
  _PXP_ConfigAlphaSurface(pColor, NumItems * LCD_BYTES_PER_PIXEL, NumItems, 1);
  _PXP_ConfigAlphaBlendNormal();
  PXP_DisableProcessSurface();
  _PXP_StartOperation();
}

/*********************************************************************
*
*       _LCD_PXP_Index2ColorBulk
*/
static void _LCD_PXP_Index2ColorBulk(LCD_COLOR * pColor, void * pIndex, U32 NumItems, U8 SizeOfIndex, pxp_output_pixel_format_t PixelFormat) {
  pxp_as_pixel_format_t InputFormat;

  //
  // Convert given parameter to input format.
  //
  switch (PixelFormat) {
  case kPXP_OutputPixelFormatARGB1555:
    InputFormat = kPXP_AsPixelFormatARGB1555;
    break;
  case kPXP_OutputPixelFormatRGB565:
    InputFormat = kPXP_AsPixelFormatRGB565;
    break;
  case kPXP_OutputPixelFormatARGB4444:
    InputFormat = kPXP_AsPixelFormatARGB4444;
    break;
  default:
  case kPXP_OutputPixelFormatARGB8888:
    InputFormat = kPXP_AsPixelFormatARGB8888;
    break;
  }
  //
  // No AS needed.
  // Configure input colors as PS.
  //
  _PXP_InitOperation();
  _PXP_ConfigOutBuffer(pColor, NumItems * LCD_BYTES_PER_PIXEL, NumItems, 1, true);
  PXP_DisableProcessSurface();
  _PXP_ConfigAlphaSurfaceEx(pIndex, NumItems * SizeOfIndex, NumItems, 1, InputFormat);
  _PXP_ConfigAlphaBlendNormal();
  _PXP_StartOperation();
}

/*********************************************************************
*
*       Static code: Display init
*
**********************************************************************
*/
/*********************************************************************
*
*       _VSyncCallback
*/
static void _VSyncCallback(void *p, void *SwitchOffBuffer) {
  GUI_USE_PARA(p);
  GUI_USE_PARA(SwitchOffBuffer);
  if (_PendingBuffer >= 0) {
    GUI_MULTIBUF_Confirm(_PendingBuffer);
#if (USE_OS == 1)
      _Semaphore_Give(_hSema_WaitForVSYNC);
#endif
    _PendingBuffer = -1;
  } else if (_PendingBuffer == -2) {
    _PendingBuffer = -1;
  }
}

/*********************************************************************
*
*       _InitPins
*/
static void _InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_00_GPIO8_IO31,           /* GPIO_AD_00 is configured as GPIO8_IO31 */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_00 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_01_GPIO9_IO00,           /* GPIO_AD_01 is configured as GPIO9_IO00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_02_GPIO9_IO01,           /* GPIO_AD_02 is configured as GPIO9_IO01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_GPIO9_IO29,           /* GPIO_AD_30 is configured as GPIO9_IO29 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_05_GPIO11_IO06,     /* GPIO_DISP_B2_05 is configured as GPIO11_IO06 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 is configured as LPI2C5_SDA */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_04 */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 is configured as LPI2C5_SCL */
      1U);                                    /* Software Input On Field: Force input path of pad GPIO_LPSR_05 */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_00_GPIO8_IO31,           /* GPIO_AD_00 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_01_GPIO9_IO00,           /* GPIO_AD_01 PAD functional properties : */
      0x0EU);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull up
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_02_GPIO9_IO01,           /* GPIO_AD_02 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_30_GPIO9_IO29,           /* GPIO_AD_30 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_DISP_B2_05_GPIO11_IO06,     /* GPIO_DISP_B2_05 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable, Highz
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_04_LPI2C5_SDA,         /* GPIO_LPSR_04 PAD functional properties : */
      0x20U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_LPSR_05_LPI2C5_SCL,         /* GPIO_LPSR_05 PAD functional properties : */
      0x20U);                                 /* Slew Rate Field: Slow Slew Rate
                                                 Drive Strength Field: normal driver
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain LPSR Field: Enabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

/*********************************************************************
*
*       _PullPanelResetPin
*/
static void _PullPanelResetPin(bool pullUp) {
  if (pullUp) {
    GPIO_PinWrite(MIPI_PANEL_RST_GPIO, MIPI_PANEL_RST_PIN, 1);
  }
  else {
    GPIO_PinWrite(MIPI_PANEL_RST_GPIO, MIPI_PANEL_RST_PIN, 0);
  }
}

/*********************************************************************
*
*       _PullPanelPowerPin
*/
static void _PullPanelPowerPin(bool pullUp) {
  if (pullUp) {
    GPIO_PinWrite(MIPI_PANEL_POWER_GPIO, MIPI_PANEL_POWER_PIN, 1);
  }
  else {
    GPIO_PinWrite(MIPI_PANEL_POWER_GPIO, MIPI_PANEL_POWER_PIN, 0);
  }
}

/*********************************************************************
*
*       _DSI_Transfer
*/
static int _DSI_Transfer(dsi_transfer_t *xfer) {
  return DSI_TransferBlocking(MIPI_DSI, xfer);
}

/*********************************************************************
*
*       _InitLcdPanel
*/
static int _InitLcdPanel(void) {
  int status;
  const gpio_pin_config_t pinConfig = {kGPIO_DigitalOutput, 0, kGPIO_NoIntmode};
  const display_config_t displayConfig = {
    .resolution   = FSL_VIDEO_RESOLUTION(XSIZE_PHYS, YSIZE_PHYS),
    .hsw          = HSW,
    .hfp          = HFP,
    .hbp          = HBP,
    .vsw          = VSW,
    .vfp          = VFP,
    .vbp          = VBP,
    .controlFlags = 0,
    .dsiLanes     = MIPI_DSI_LANE_NUM,
  };

  GPIO_PinInit(MIPI_PANEL_POWER_GPIO, MIPI_PANEL_POWER_PIN, &pinConfig);
  GPIO_PinInit(MIPI_PANEL_BL_GPIO, MIPI_PANEL_BL_PIN, &pinConfig);
  GPIO_PinInit(MIPI_PANEL_RST_GPIO, MIPI_PANEL_RST_PIN, &pinConfig);
  status = RM68200_Init(&rm68200Handle, &displayConfig);
  if (status == kStatus_Success) {
    GPIO_PinWrite(MIPI_PANEL_BL_GPIO, MIPI_PANEL_BL_PIN, 1);
  }
  return status;
}

/*********************************************************************
*
*       _SetMipiDsiConfig
*/
static void _SetMipiDsiConfig(void) {
  dsi_config_t           dsiConfig;
  dsi_dphy_config_t      dphyConfig;
  const dsi_dpi_config_t dpiConfig = {
    .pixelPayloadSize = XSIZE_PHYS,
    .dpiColorCoding   = kDSI_Dpi24Bit,
    .pixelPacket      = kDSI_PixelPacket24Bit,
    .videoMode        = kDSI_DpiBurst,
    .bllpMode         = kDSI_DpiBllpLowPower,
    .polarityFlags    = kDSI_DpiVsyncActiveLow | kDSI_DpiHsyncActiveLow,
    .hfp              = HFP,
    .hbp              = HBP,
    .hsw              = HSW,
    .vfp              = VFP,
    .vbp              = VBP,
    .panelHeight      = YSIZE_PHYS,
    .virtualChannel   = 0
  };
  DSI_GetDefaultConfig(&dsiConfig);
  dsiConfig.numLanes       = MIPI_DSI_LANE_NUM;
  dsiConfig.autoInsertEoTp = true;
  //
  /// Init the DSI module.
  //
  DSI_Init(MIPI_DSI, &dsiConfig);

  // Init DPHY.
  //
  // The DPHY bit clock must be fast enough to send out the pixels, it should be
  // larger than:
  //
  //         (Pixel clock * bit per output pixel) / number of MIPI data lane
  //
  // Here the desired DPHY bit clock multiplied by ( 9 / 8 = 1.125) to ensure
  // it is fast enough.
  //
  // Note that the DSI output pixel is 24bit per pixel.
  //
  mipiDsiDphyBitClkFreq_Hz = mipiDsiDpiClkFreq_Hz * (24 / MIPI_DSI_LANE_NUM);
  mipiDsiDphyBitClkFreq_Hz = MIPI_DPHY_BIT_CLK_ENLARGE(mipiDsiDphyBitClkFreq_Hz);
  DSI_GetDphyDefaultConfig(&dphyConfig, mipiDsiDphyBitClkFreq_Hz, mipiDsiTxEscClkFreq_Hz);
  mipiDsiDphyBitClkFreq_Hz = DSI_InitDphy(MIPI_DSI, &dphyConfig, mipiDsiDphyRefClkFreq_Hz);
  //
  // Init DPI interface.
  //
  DSI_SetDpiConfig(MIPI_DSI, &dpiConfig, MIPI_DSI_LANE_NUM, mipiDsiDpiClkFreq_Hz, mipiDsiDphyBitClkFreq_Hz);
}

/*********************************************************************
*
*       _InitMipiDsiClock
*/
static void _InitMipiDsiClock(void) {
  U32 mipiDsiEscClkFreq_Hz;

  //
  // RxClkEsc max 60MHz, TxClkEsc 12 to 20MHz.
  // RxClkEsc = 528MHz / 11 = 48MHz.
  // TxClkEsc = 528MHz / 11 / 4 = 16MHz.
  //
  const clock_root_config_t mipiEscClockConfig = {
    .clockOff = false,
    .mux      = 4,  // PLL_528
    .div      = 11,
  };
  const clock_group_config_t mipiEscClockGroupConfig = {
    .clockOff = false,
    .resetDiv = 2,
    .div0     = 2,
  };
  //
  // DPHY reference clock, use OSC 24MHz clock.
  //
  const clock_root_config_t mipiDphyRefClockConfig = {
      .clockOff = false,
      .mux      = 1,  // OSC_24M.
      .div      = 1,
  };

