SoumyaCode74/STM32_MCU_Peripherals/emWin_V636_OBJ_STM32/Sample/LCDConf/GUIDRV_Lin/iMXRT1176_EVK/LCDConf.c
  CLOCK_SetRootClock(kCLOCK_Root_Mipi_Esc, &mipiEscClockConfig);
  mipiDsiEscClkFreq_Hz = CLOCK_GetRootClockFreq(kCLOCK_Root_Mipi_Esc);
  CLOCK_SetGroupConfig(kCLOCK_Group_MipiDsi, &mipiEscClockGroupConfig);
  mipiDsiTxEscClkFreq_Hz = mipiDsiEscClkFreq_Hz / 3;
  CLOCK_SetRootClock(kCLOCK_Root_Mipi_Ref, &mipiDphyRefClockConfig);
  mipiDsiDphyRefClkFreq_Hz = BOARD_XTAL0_CLK_HZ;
}

/*********************************************************************
*
*       _InitDisplayInterface
*/
static int _InitDisplayInterface(void) {
  CLOCK_EnableClock(kCLOCK_Video_Mux);

  //
  // LCDIF v2 output to MIPI DSI.
  //
  VIDEO_MUX->VID_MUX_CTRL.SET = VIDEO_MUX_VID_MUX_CTRL_MIPI_DSI_SEL_MASK;
  //
  // 1. Power on and isolation off.
  //
  PGMC_BPC4->BPC_POWER_CTRL |= (PGMC_BPC_BPC_POWER_CTRL_PSW_ON_SOFT_MASK | PGMC_BPC_BPC_POWER_CTRL_ISO_OFF_SOFT_MASK);
  //
  // 2. Assert MIPI reset.
  //
  IOMUXC_GPR->GPR62 &= ~(IOMUXC_GPR_GPR62_MIPI_DSI_PCLK_SOFT_RESET_N_MASK | IOMUXC_GPR_GPR62_MIPI_DSI_ESC_SOFT_RESET_N_MASK |
                         IOMUXC_GPR_GPR62_MIPI_DSI_BYTE_SOFT_RESET_N_MASK | IOMUXC_GPR_GPR62_MIPI_DSI_DPI_SOFT_RESET_N_MASK);
  //
  // 3. Setup clock.
  //
  _InitMipiDsiClock();
  //
  // 4. Deassert PCLK and ESC reset.
  //
  IOMUXC_GPR->GPR62 |= (IOMUXC_GPR_GPR62_MIPI_DSI_PCLK_SOFT_RESET_N_MASK | IOMUXC_GPR_GPR62_MIPI_DSI_ESC_SOFT_RESET_N_MASK);
  //
  // 5. Configures peripheral.
  //
  _SetMipiDsiConfig();
  //
  // 6. Deassert BYTE and DBI reset.
  //
  IOMUXC_GPR->GPR62 |= (IOMUXC_GPR_GPR62_MIPI_DSI_BYTE_SOFT_RESET_N_MASK | IOMUXC_GPR_GPR62_MIPI_DSI_DPI_SOFT_RESET_N_MASK);
  //
  // 7. Configure the panel.
  //
  return _InitLcdPanel();
}

/*********************************************************************
*
*       _VerifyDisplayClockSource
*/
static int _VerifyDisplayClockSource(void) {
  int status;
  U32 srcClkFreq;

  // 
  // In this implementation, the SYSPLL2 (528M) clock is used as the source
  // of LCDIFV2 pixel clock and MIPI DSI ESC clock. The OSC24M clock is used
  // as the MIPI DSI DPHY PLL reference clock. This function checks the clock
  // source are valid. OSC24M is always valid, so only verify the SYSPLL2.
  // 
  srcClkFreq = CLOCK_GetPllFreq(kCLOCK_PllSys2);
  if (528 != (srcClkFreq / 1000000)) {
    status = kStatus_Fail;
  } else {
    status = kStatus_Success;
  }
  return status;
}

/*********************************************************************
*
*       _InitLcdifClock
*/
static void _InitLcdifClock(void) {
  // 
  // The pixel clock is (height + VSW + VFP + VBP) * (width + HSW + HFP + HBP) * frame rate.
  // 
  // For 60Hz frame rate, the RK055IQH091 pixel clock should be 36MHz.
  // the RK055AHD091 pixel clock should be 62MHz.
  // 
  const clock_root_config_t lcdifClockConfig = {
    .clockOff = false,
    .mux      = 4, /*!< PLL_528. */
    .div = 9,
  };
  CLOCK_SetRootClock(kCLOCK_Root_Lcdifv2, &lcdifClockConfig);
  mipiDsiDpiClkFreq_Hz = CLOCK_GetRootClockFreq(kCLOCK_Root_Lcdifv2);
}

/*********************************************************************
*
*       _PrepareDisplayController
*/
static int _PrepareDisplayController(void) {
  int status;

  status = _VerifyDisplayClockSource();
  if (status != kStatus_Success) {
    return status;
  }
  _InitLcdifClock();
  status = _InitDisplayInterface();
  if (kStatus_Success == status) {
    NVIC_ClearPendingIRQ(LCDIFv2_IRQn);
    NVIC_SetPriority(LCDIFv2_IRQn, 8);
    EnableIRQ(LCDIFv2_IRQn);
  }
  return kStatus_Success;
}

/*********************************************************************
*
*       _InitController
*/
static void _InitController(void) {
  static U8    Done;
  int          status;
  dc_fb_info_t fbInfo;

  if (Done == 0) {
#if (USE_OS == 1)
    _Semaphore_Create(&_hSema_WaitForPXP);
    _Semaphore_Create(&_hSema_WaitForVSYNC);
#endif
    //
    // Set up GPIOs
    //
    _InitPins();
    //
    // Set up LCD controller
    //
    _PrepareDisplayController();

    status = g_dc.ops->init(&g_dc);
    if (kStatus_Success != status) {
      while (1);
    }
    g_dc.ops->getLayerDefaultConfig(&g_dc, 0, &fbInfo);
    fbInfo.pixelFormat = PIXEL_FORMAT;
    fbInfo.width       = XSIZE_PHYS;
    fbInfo.height      = YSIZE_PHYS;
    fbInfo.strideBytes = XSIZE_PHYS * LCD_BYTES_PER_PIXEL;
    g_dc.ops->setLayerConfig(&g_dc, 0, &fbInfo);
    g_dc.ops->setCallback(&g_dc, 0, _VSyncCallback, NULL);
    //
    // Init PXP
    //
    PXP_Init(PXP);
    PXP_READ_QOS = 15;
#if (USE_OS == 1)
    NVIC_EnableIRQ(PXP_IRQn);
    NVIC_SetPriority(PXP_IRQn, 0xf);
    PXP_EnableInterrupts( PXP, kPXP_CompleteInterruptEnable );
#endif
    Done = 1;
  }
}

/*********************************************************************
*
*       _ClearCache
*/
static void _ClearCache(U32 v) {
  GUI_USE_PARA(v);
  SCB_CleanInvalidateDCache();
}

/*********************************************************************
*
*       _ConfigDriver
*
* Purpose:
*   Called from LCD_ROTATE_SetSelEx() after a new driver has been selected in order to
*   configure the new driver.
*/
static void _ConfigDriver(GUI_DEVICE * pDevice, int Index, int LayerIndex) {
  int EnablePXP;

  GUI_USE_PARA(Index);
  GUI_USE_PARA(LayerIndex);
  //
  // Display driver configuration
  //
  if (LCD_GetSwapXY()) {
    LCD_SetSizeEx (0, YSIZE_PHYS, XSIZE_PHYS);
    LCD_SetVSizeEx(0, YSIZE_PHYS, XSIZE_PHYS);
  } else {
    LCD_SetSizeEx (0, XSIZE_PHYS, YSIZE_PHYS);
    LCD_SetVSizeEx(0, XSIZE_PHYS, YSIZE_PHYS);
  }
  LCD_SetVRAMAddrEx(0, (void *)_aBufferAddress[0]);
  //
  // Enable PXP accelerator
  //
  LCD_PXP_Enable(1);
  //
  // Update the current display rotation angle for PXP.
  //
  if      ((pDevice->pDeviceAPI == GUIDRV_LIN_32)     || (pDevice->pDeviceAPI == GUIDRV_LIN_16))     {
    _PXP_Rotation = kPXP_Rotate0;
  }
  else if ((pDevice->pDeviceAPI == GUIDRV_LIN_OSX_32) || (pDevice->pDeviceAPI == GUIDRV_LIN_OSX_16)) {
    _PXP_Rotation = kPXP_Rotate90;
  }
  else if ((pDevice->pDeviceAPI == GUIDRV_LIN_OXY_32) || (pDevice->pDeviceAPI == GUIDRV_LIN_OXY_16)) {
    _PXP_Rotation = kPXP_Rotate180;
  }
  else if ((pDevice->pDeviceAPI == GUIDRV_LIN_OSY_32) || (pDevice->pDeviceAPI == GUIDRV_LIN_OSY_16)) {
    _PXP_Rotation = kPXP_Rotate270;
  }
}

/*********************************************************************
*
*       Interrupt handlers
*
**********************************************************************
*/
#if (USE_OS == 1)
/*********************************************************************
*
*       PXP_IRQHandler
*/
void PXP_IRQHandler(void);
void PXP_IRQHandler(void) {
  if (PXP_GetStatusFlags( PXP ) & kPXP_CompleteFlag ) {
    PXP_ClearStatusFlags( PXP, kPXP_CompleteFlag );
    _Semaphore_Give(_hSema_WaitForPXP);
  }
}
#endif

/*********************************************************************
*
*       LCDIFv2_IRQHandler
*/
void LCDIFv2_IRQHandler(void);
void LCDIFv2_IRQHandler(void) {
  DC_FB_LCDIFV2_IRQHandler(&g_dc);
}

/*********************************************************************
*
*       Public code
*
**********************************************************************
*/
/*********************************************************************
*
*       LCD_PXP_Enable
*/
void LCD_PXP_Enable(int Enable) {
  if (Enable) {
    GUI_AlphaEnableFillRectHW(1);
    LCD_SetDevFunc(0, LCD_DEVFUNC_FILLRECT,   (void(*)(void))_LCD_PXP_FillRect);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))_LCD_PXP_CopyBuffer);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYRECT,   (void(*)(void))_LCD_PXP_CopyRect);
    //
    // Set up functions for drawing bitmaps and memory devices with PXP
    //
    GUI_SetFuncDrawBitmapEx   (_LCD_PXP_DrawBitmapEx);
    GUI_SetFuncMixColorsBulk  (_LCD_PXP_MixColorsBulk);
    GUI_SetFuncDrawAlpha      (_LCD_PXP_DrawMemdevAlpha,
        (GUI_DRAWBITMAP_FUNC *)_LCD_PXP_DrawBitmap32bpp);
#if GUI_SUPPORT_MEMDEV
#if GUI_MEMDEV_SUPPORT_CUSTOMDRAW
    GUI_MEMDEV_SetDrawMemdev16bppFunc(_LCD_PXP_DrawMemdev16bpp);
#endif
    GUI_SetFuncDrawM565       (_LCD_PXP_DrawMemdevM565,
                               _LCD_PXP_DrawBitmapM565);
    //
    // Memdev manupulation functions with PXP
    //
    GUI_MEMDEV_SetBlendFunc   (_LCD_PXP_BlendMemdev);
#endif
    //
    // Color conversion functions
    //
    GUI_PXP_SETCOLORCONV(M1555I);
    GUI_PXP_SETCOLORCONV(M565);
    GUI_PXP_SETCOLORCONV(M4444I);
    GUI_PXP_SETCOLORCONV(M8888I);
    GUICC_M888_SetCustColorConv(_LCD_PXP_Color2IndexBulk_M888, NULL);
  } else {
    GUI_AlphaEnableFillRectHW(0);
    LCD_SetDevFunc(0, LCD_DEVFUNC_FILLRECT,   (void(*)(void))NULL);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYBUFFER, (void(*)(void))NULL);
    LCD_SetDevFunc(0, LCD_DEVFUNC_COPYRECT,   (void(*)(void))NULL);
    //
    // Clear functions for drawing bitmaps and memory devices with PXP
    //
    GUI_SetFuncDrawBitmapEx   (NULL);
    GUI_SetFuncMixColorsBulk  (NULL);
    GUI_SetFuncDrawAlpha      (NULL,
        (GUI_DRAWBITMAP_FUNC *)NULL);
#if GUI_SUPPORT_MEMDEV
#if GUI_MEMDEV_SUPPORT_CUSTOMDRAW
    GUI_MEMDEV_SetDrawMemdev16bppFunc(NULL);
#endif
    GUI_SetFuncDrawM565       (NULL,
                               NULL);
    //
    // Memdev manupulation functions with PXP
    //
    GUI_MEMDEV_SetBlendFunc   (NULL);
#endif
    //
    // Color conversion functions
    //
    GUICC_M1555I_SetCustColorConv(NULL, NULL);
    GUICC_M565_SetCustColorConv  (NULL, NULL);
    GUICC_M4444I_SetCustColorConv(NULL, NULL);
    GUICC_M8888I_SetCustColorConv(NULL, NULL);
    GUICC_M888_SetCustColorConv  (NULL, NULL);
  }
}

/*********************************************************************
*
*       LCD_X_Config
*
* Purpose:
*   Called during the initialization process in order to set up the
*   display driver configuration.
*
*/
void LCD_X_Config(void) {
  GUI_DEVICE * pDevice;

#if (NUM_BUFFERS > 1)
  GUI_MULTIBUF_Config(NUM_BUFFERS);
#endif
  //
  // Set display driver and color conversion for 1st layer
  //
  pDevice = GUI_DEVICE_CreateAndLink(DISPLAY_DRIVER, COLOR_CONVERSION, 0, 0);
  //
  // Configure the initial driver
  //
  _ConfigDriver(pDevice, 0, GUI_ROTATION_0);
  //
  // If screen rotation is not required the following section could be switched off to spare ROM
  //
#if ENABLE_DISPLAY_ROTATION
  //
  // Create additional drivers and add them to the display rotation module
  //
  LCD_ROTATE_AddDriverExOrientation(DISPLAY_DRIVER_CCW, 0, GUI_ROTATION_CCW);
  LCD_ROTATE_AddDriverExOrientation(DISPLAY_DRIVER_180, 0, GUI_ROTATION_180);
  LCD_ROTATE_AddDriverExOrientation(DISPLAY_DRIVER_CW,  0, GUI_ROTATION_CW);
  //
  // Set callback function to be used for layer 0
  //
  LCD_ROTATE_SetCallback(_ConfigDriver, 0);
#endif
  //
  // Cache management
  //
  GUI_DCACHE_SetClearCacheHook(_ClearCache);
}

/*********************************************************************
*
*       LCD_X_DisplayDriver
*
* Purpose:
*   This function is called by the display driver for several purposes.
*   To support the according task the routine needs to be adapted to
*   the display controller. Please note that the commands marked with
*   'optional' are not cogently required and should only be adapted if
*   the display controller supports these features.
*
* Parameter:
*   LayerIndex - Index of layer to be configured
*   Cmd        - Please refer to the details in the switch statement below
*   pData      - Pointer to a LCD_X_DATA structure
*
* Return Value:
*   < -1 - Error
*     -1 - Command not handled
*      0 - Ok
*/
int LCD_X_DisplayDriver(unsigned LayerIndex, unsigned Cmd, void * pData) {
  int r;
  LCD_X_SHOWBUFFER_INFO *pInfo;
  GUI_USE_PARA(LayerIndex);
  r = 0;
  switch (Cmd) {
  //
  // Required
  //
  case LCD_X_INITCONTROLLER: {
    _InitController();
    PID_X_Init();
    break;
  }
  case LCD_X_ON: {
    _PendingBuffer = -2;
    g_dc.ops->setFrameBuffer(&g_dc, 0, (void *)_aBufferAddress[_BackBuffer]);
    //
    // Wait for frame buffer sent to display controller video memory.
    //
    if ((g_dc.ops->getProperty(&g_dc) & kDC_FB_ReserveFrameBuffer) == 0) {
      while (_PendingBuffer == -2);
    }
    g_dc.ops->enableLayer(&g_dc, 0);
    break;
  }
  case LCD_X_SHOWBUFFER: {
    pInfo          = (LCD_X_SHOWBUFFER_INFO *)pData;
    _PendingBuffer = pInfo->Index;
    //
    // Make the given buffer visible
    //
    g_dc.ops->setFrameBuffer(&g_dc, 0, (void *)_aBufferAddress[pInfo->Index]);
    //
    // Wait for VSYNC ISR to restore '_PendingBuffer'
    //
#if (USE_OS == 1)
    _Semaphore_Take(_hSema_WaitForVSYNC);
#else
    while (_PendingBuffer >= 0);
#endif
    return 0;
  }
  default:
    r = -1;
    break;
  }
  return r;
}

/*************************** End of file ****************************/
